//=============================================================================
//
// BG画面処理 [cursorWM.h]
// Author : GP11A132 21 DAYA MAHAPUTRA
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct CURSORWM
{
	D3DXVECTOR3		pos;		// ポリゴンの座標
	float			w, h;		// 幅と高さ
	int				texNo;		// 使用しているテクスチャ番号

};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitCursorWM(void);
void UninitCursorWM(void);
void UpdateCursorWM(void);
void DrawCursorWM(void);

