//=============================================================================
//
// BG画面処理 [iconWM.h]
// Author : GP11A132 21 DAYA MAHAPUTRA
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ICON_MAX					(2)						// アイコンの数

struct ICONWM
{
	D3DXVECTOR3		pos;		// ポリゴンの座標
	float			w, h;		// 幅と高さ
	int				texNo;		// 使用しているテクスチャ番号
	BOOL			use;
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitIconWM(void);
void UninitIconWM(void);
void UpdateIconWM(void);
void DrawIconWM(void);

ICONWM *GetIconWM(int currentLocation);
