//=============================================================================
//
// Layer画面処理 [layer.h]
// Author : GP11A132 21 DAYA MAHAPUTRA
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct LAYER
{
	D3DXVECTOR3		pos;		// ポリゴンの座標
	float			w, h;		// 幅と高さ
	int				texNo;		// 使用しているテクスチャ番号
	float			r, g, b;	// レイヤーのRGB

};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitLayer(void);
void UninitLayer(void);
void UpdateLayer(void);
void DrawLayer(void);

LAYER *GetLayer(void);
