//=============================================================================
//
// タイトル画面処理 [titleText.h]
// Author : GP11A132 21 DAYA MAHAPUTRA
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct TITLETEXT
{
	D3DXVECTOR3		pos;		// ポリゴンの座標
	float			w, h;		// 幅と高さ
	int				texNo;		// 使用しているテクスチャ番号
	float			a;			// 透明さ

};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitleText(void);
void UninitTitleText(void);
void UpdateTitleText(void);
void DrawTitleText(void);

TITLETEXT *GetTitleText(void);


