//=============================================================================
//
// Waterfall画面処理 [waterfall.h]
// Author : GP11A132 21 DAYA MAHAPUTRA
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct WATERFALL
{
	D3DXVECTOR3		pos;		// ポリゴンの座標
	float			w, h;		// 幅と高さ
	int				texNo;		// 使用しているテクスチャ番号
	int				countAnim;
	int				patternAnim;
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitWaterfall(void);
void UninitWaterfall(void);
void UpdateWaterfall(void);
void DrawWaterfall(void);